feature_seed/src/prepare/FeatureKnowledgeBase/virtuoso/function/results/445.json

{
    "HTML": [
        "https://docs.openlinksw.com/virtuoso/fn_soap_client/"
    ],
    "Title": [
        "soap_client"
    ],
    "Feature": [
        "soap_client(url, operation, target_namespace, parameters, headers, soap_action, attachments, ticket, passwd, user_name, user_password, auth_type, security_type, debug, template, style, version, direction, http_header, security_schema, time_out)"
    ],
    "Description": [
        "Invoke a SOAP service and returns result value.",
        "This will invoke the specified SOAP service."
    ],
    "Examples": [
        "resp :=\n\tSOAP_CLIENT (\n\t  url=>'http://example.com/SecureWebServices',\n\t  operation=>'AddInt',\n\t  parameters=>vector (vector ('a', 'int'), 3, vector ('b', 'int'), 4),\n\t  auth_type=>'key',\n\t  ticket=>xenc_key_inst_create ('WSDK Sample Symmetric Key'),\n\t  security_type=>'encrypt',\n\t  target_namespace=>'http://temp.uri/',\n\t  soap_action=>'\"http://temp.uri/#AddInt\"',\n\t  style=>6);",
        "------------ REQUEST ------------------\n<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\"\n          encodingType=\"http://schemas.xmlsoap.org/soap/encoding/\" >\n  <Header xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\" >\n    <Security xmlns=\"http://schemas.xmlsoap.org/ws/2002/07/secext\" >\n      <ReferenceList xmlns=\"http://www.w3.org/2001/04/xmlenc#\" >\n        <DataReference xmlns=\"http://www.w3.org/2001/04/xmlenc#\"\n         URI=\"#Id-6831bf5c-f4dc-d611-bb59-90b4c67d3be5\" />\n      </ReferenceList>\n    </Security>\n  </Header>\n  <Body xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n      <EncryptedData xmlns=\"http://www.w3.org/2001/04/xmlenc#\"\n                   Type=\"http://www.w3.org/2001/04/xmlenc#Content\"\nxml:id=\"id-6831bf5c-f4dc-d611-bb59-90b4c67d3be5\" >\n      <EncryptionMethod xmlns=\"http://www.w3.org/2001/04/xmlenc#\"\n                      Algorithm=\"http://www.w3.org/2001/04/xmlenc#tripledes-cbc\" />\n      <KeyInfo xmlns=\"http://www.w3.org/2000/09/xmldsig#\" >\n         <KeyName xmlns=\"http://www.w3.org/2000/09/xmldsig#\" >WSDK Sample Symmetric Key</KeyName>\n      </KeyInfo>\n      <CipherData xmlns=\"http://www.w3.org/2001/04/xmlenc#\" >\n        <CipherValue xmlns=\"http://www.w3.org/2001/04/xmlenc#\" >s8YHzbGSxsgfslN6\n        eJu7UeiTExKeqwCHrqFml24C6mY8SLxhNE0Vy6xBuS50uchjbupjE4Z8EtkSuyljR8mkpmrW\n        GCfUQEvrW7iu1ji0j4XR7m5P4dgxh7RYwqxqoprwTnCZ9b6X9D/UpN0aAYVdNs+S6l2Rw56d\n        s5Gf4sv2f/sTYpEHTYPReqyo+9LSm9CsbtlPXia9djkH+75PUtsKZXZvHnVfHICQGjBJPpsh\n        eE7Dq7mt8AkKVQ==</CipherValue>\n       </CipherData>\n    </EncryptedData>\n  </Body>\n</Envelope>",
        "------------ RESPONSE -----------------\n<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\"\n          encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\" >\n  <Body xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\" >\n    <AddIntResponse xmlns=\"http://temp.uri/\" >\n      <CallReturn type=\"http://www.w3.org/2001/XMLSchema:int\" >7</CallReturn>\n    </AddIntResponse>\n  </Body>\n</Envelope>",
        "...\n     resp := soap_client (url=>url, operation=>'echoVoidSoapHeader',\n\t\t          parameters=>vector(),\n \t                  headers=>vector(\n\t\t\t    vector('echoMeStringRequest',\n\t\t\t           'http://soapinterop.org/:echoMeStringRequest',\n\t\t\t\t   1,\n\t\t\t\t   'http://schemas.xmlsoap.org/soap/actor/next') ,\n\t\t                   vector('String')),\n \t\t          style=>7,\n\t\t\t  soap_action=>'\"http://soapinterop.org\"',\n\t\t\t  target_namespace=>'http://soapinterop.org'\n\t\t\t  );\n     ...",
        "<SOAP:Envelope xmlns:SOAP=\"http://schemas.xmlsoap.org/soap/envelope/\"\n xmlns:ns1=\"http://soapinterop.org/echoheader/\"\n xmlns:ns0=\"http://soapinterop.org/\">\n   <SOAP:Header>\n     <ns0:echoMeStringRequest SOAP:mustUnderstand='1' SOAP:actor='http://schemas.xmlsoap.org/soap/actor/next'>\n       <ns1:varString>String</ns1:varString>\n     </ns0:echoMeStringRequest>\n   </SOAP:Header>\n   <SOAP:Body>\n     <echoVoidSoapHeader xmlns='http://soapinterop.org' ></echoVoidSoapHeader>\n   </SOAP:Body>\n</SOAP:Envelope>",
        "<SOAP:Envelope xmlns:SOAP=\"http://schemas.xmlsoap.org/soap/envelope/\"\n  xmlns:ns2=\"http://soapinterop.org/echoheader/\"\n  xmlns:ns1=\"http://soapinterop.org/\"\n  xmlns:ns0=\"http://soapinterop.org\">\n  <SOAP:Header>\n    <ns1:echoMeStringResponse>\n      <ns2:varString>String</ns2:varString>\n    </ns1:echoMeStringResponse>\n  </SOAP:Header>\n  <SOAP:Body>\n    <ns1:echoVoidSoapHeaderResponse />\n  </SOAP:Body>\n</SOAP:Envelope>",
        "SQL> create procedure\n  WS.SOAPDEMO.SOAPTEST (in par varchar)\n{\n  return (upper(par));\n};\nSQL> grant execute on WS.SOAPDEMO.SOAPTEST to SOAPDEMO;\nSQL> VHOST_DEFINE (vhost=>'*sslini*',lhost=>'*sslini*',lpath=>'/secure',\n ppath=>'/SOAP/',soap_user=>'SOAPDEMO');\n-- SSL connection with server's certificate verification\nSQL> select xpath_eval ('//CallReturn/text()', xml_tree_doc (\n \tsoap_client (url=>'https://localhost:4443/secure',\n\toperation=>'SOAPTEST', parameters=>vector('par', 'demotext'),\n\tticket=>'cli5.p12', passwd=>'secret')));\n-- SSL connection only, no certificate verification\nSQL> select xpath_eval ('//CallReturn/text()', xml_tree_doc (\n \tsoap_client (url=>'https://localhost:4443/secure',\n\toperation=>'SOAPTEST', parameters=>vector('par', 'demotext'),\n\tticket=>'1')));\n-- response\ncallret\nVARCHAR\nDEMOTEXT"
    ],
    "Category": [
        "SOAP function"
    ]
}